#2. Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.
#1 - 1 * 1, 2 - 1 * 2, 3 - 1 * 2 * 3, 4 - 1 * 2 * 3 * 4 и т.д.
#- 4 -> [1, 2, 6, 24]
#- 6 -> [1, 2, 6, 24, 120, 720]

a = int(input())
if a < 1:
    print("Ошибка! Введите верное число")
else:
    my_list = [1]
    result_a = 1
    for i in range(2, a+1):
        result_a *= i
        my_list.append(result_a)
    print(my_list)